parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
        update_oled("AWS", command, "Success");
}

/**
 * @brief Upload data to AWS for periodic box updates
 *
 * @param box_id
 * @param message
 */
void sendData(String box_id, String message)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    char token = ',';
    char params[UPDATE_PARAMETERS][10] = {
        {/*Count*/},
        {/*Temperature*/},
        {/*Battery*/},
        {/*Offset*/},
        {/*Average Weight*/}};

    int j = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (message[i] != token)
            params[j][i % 10] = message[i];
        else
            j++;
    }
    String c = (String)params[0]; // Count
    String t = (String)params[1]; // Temperature
    String b = (String)params[2]; // Battery
    String o = (String)params[3]; // Offset
    String a = (String)params[4]; // Average Weight

    StaticJsonDocument<50> doc;
    doc["time"] = (char)year + '/' + (char)month + '/' + (char)date + ' ' + (char)hour + ':' + (char)minutes + ':' + (char)seconds;
    doc["cmd"] = "ask";
    doc["c"] = c;
    doc["t"] = t;
    doc["b"] = b;
    doc["o"] = o;
    doc["a"] = a;
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));

    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
        update_oled("AWS", "update", "Success");
}

// TODO: Basic Setup, Code Operation Starts here
void setup()
{
    Serial.begin(115200);
    pin_setup();
    EEPROM.begin(EEPROM_SIZE);
    rgb_ring_setup(110);
    oled_setup();
    nrf24_setup();
    sd_setup();
    wifi_ntp_setup();
    // aws_setup();
    // read_box_details_from_sd_card();
    RL.readLines(ERROR_LOG_FILE, &handleEachErrorLine);
    // if (BOX_DETAILS[0][0] == NULL)
    // {
    //     solid_rgb_ring(RED_COLOR);
    //     update_oled("No", "Box", "Linked");
    //     Serial.println("No Box Linked");
    //     while (BOX_DETAILS[0][0] == NULL)
    //     {
    //     }
    // }
    configure_timer();
    timerAlarmEnable(timer);
    print_company_logo();
    lastMillis = millis();
}

// TODO: Loop for the code
void loop()
{

    //? Detects when the rotary encoder button is pressed
    if (digitalRead(outputS) == HIGH)
    {
        timerStop(timer);
        timerAlarmDisable(timer);
        delay(3 * DEBOUNCE_TIME); // Debounce time
        if (digitalRead(outputS) == HIGH)
        {
            delay(500);
            read_rotary_encoder(); // Open Main Menu
            print_company_logo();
        }
        delay(500);
        timerStart(timer);
        timerAlarmEnable(timer);
        set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
    }

    //? When Count variable overflows the Timer Value, the periodic box polling is done
    if ((count != 0) && ((count % DELAY_ONE_MINUTES) == 0))
    {
        if (previous_count != count)
        {
            Serial.println("Hit at: " + (String)count + " seconds");
            solid_rgb_ring(YELLOW_COLOR);
            //     regular_box_update(count);
            if (count >= DELAY_SIXTY_MINUTES)
                count = 0;
            previous_count = count;
            print_company_logo();
            set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
        }
    }

    //? Main Splash Screen Cycle
    if ((millis() - lastMillis) > MAIN_SCREEN_REFRESH_TIME)
    {
        lastMillis = millis();
        switch (main_screen_count)
        {
        case 1: // Printing Company Logo
            print_company_logo();
            break;

        case 2: // Shows the currently connected boxes
        {
            connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
            update_oled("Connected", "Boxes:", (String)connected_boxes);
        }
        break;

        case 3: // Checks the status of the Wi-Fi Connection
        {
            String wifi_connection_status = "Disconnected";
            if (WiFi.status() == WL_CONNECTED)
                wifi_connection_status = "Connected";
            update_oled("WiFi", ssid, wifi_connection_status);
        }
        break;

        case 4: // Fetches latest time from RTC
        {
            DateTime now = rtc.now();
            year = now.year();
            month = now.month();
            seconds = now.second();
            hour = now.hour();
            minutes = now.minute();
            seconds = now.second();

            String day = (String)year + '/' + (String)month + '/' + (String)date;
            String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
            update_oled("Date Time", day, time);
        }
        break;

        case 5: // Checks AWS Connection
        {
            String mqtt_connection_status = "Disconnected";
            if (client.connected())
                mqtt_connection_status = "Connected";
            update_oled("MQTT", mqtt_connection_status, "");
        }
        break;

        case 6: // Shows the latest Error Log
            update_oled("Latest", "Error", latest_error_log);
            break;

        default: // Set the main screen counter to zero
            main_screen_count = 0;
            break;
        }
        main_screen_count++;
    }

    //? Polls NRF24 to collect live data from boxes
    // if (digitalRead(NRF24_IRQ) == LOW)
    // {
    //     Serial.println("Message recieved on NRF");
    //     String box_id = read_radio();
    //     if (box_id.length() < BOX_ID_LENGTH)
    //     {
    //         String str_box_address = fetch_box_address(box_id);
    //         byte box_address[COMMUNICATION_ID_LENGTH];
    //         for (size_t i = 0; i < count; i++)
    //             box_address[i] = str_box_address[i];
    //         update_box_data(box_id, box_address);
    //     }
    //     set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
    // }
}
